{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.8.1", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 200, 200, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float32", "filters": 200, "kernel_size": [4, 4], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d", "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten", "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_3", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_4", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "ethnicity", "trainable": true, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "ethnicity", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "gender", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "gender", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "age", "trainable": true, "dtype": "float32", "units": 150, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "age", "inbound_nodes": [[["dense_4", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["ethnicity", 0, 0], ["gender", 0, 0], ["age", 0, 0]]}}, "training_config": {"loss": {"ethnicity": "categorical_crossentropy", "gender": "categorical_crossentropy", "age": "categorical_crossentropy"}, "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "ethnicity_accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}], [{"class_name": "MeanMetricWrapper", "config": {"name": "gender_accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}], [{"class_name": "MeanMetricWrapper", "config": {"name": "age_accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of235.bin", "group1-shard2of235.bin", "group1-shard3of235.bin", "group1-shard4of235.bin", "group1-shard5of235.bin", "group1-shard6of235.bin", "group1-shard7of235.bin", "group1-shard8of235.bin", "group1-shard9of235.bin", "group1-shard10of235.bin", "group1-shard11of235.bin", "group1-shard12of235.bin", "group1-shard13of235.bin", "group1-shard14of235.bin", "group1-shard15of235.bin", "group1-shard16of235.bin", "group1-shard17of235.bin", "group1-shard18of235.bin", "group1-shard19of235.bin", "group1-shard20of235.bin", "group1-shard21of235.bin", "group1-shard22of235.bin", "group1-shard23of235.bin", "group1-shard24of235.bin", "group1-shard25of235.bin", "group1-shard26of235.bin", "group1-shard27of235.bin", "group1-shard28of235.bin", "group1-shard29of235.bin", "group1-shard30of235.bin", "group1-shard31of235.bin", "group1-shard32of235.bin", "group1-shard33of235.bin", "group1-shard34of235.bin", "group1-shard35of235.bin", "group1-shard36of235.bin", "group1-shard37of235.bin", "group1-shard38of235.bin", "group1-shard39of235.bin", "group1-shard40of235.bin", "group1-shard41of235.bin", "group1-shard42of235.bin", "group1-shard43of235.bin", "group1-shard44of235.bin", "group1-shard45of235.bin", "group1-shard46of235.bin", "group1-shard47of235.bin", "group1-shard48of235.bin", "group1-shard49of235.bin", "group1-shard50of235.bin", "group1-shard51of235.bin", "group1-shard52of235.bin", "group1-shard53of235.bin", "group1-shard54of235.bin", "group1-shard55of235.bin", "group1-shard56of235.bin", "group1-shard57of235.bin", "group1-shard58of235.bin", "group1-shard59of235.bin", "group1-shard60of235.bin", "group1-shard61of235.bin", "group1-shard62of235.bin", "group1-shard63of235.bin", "group1-shard64of235.bin", "group1-shard65of235.bin", "group1-shard66of235.bin", "group1-shard67of235.bin", "group1-shard68of235.bin", "group1-shard69of235.bin", "group1-shard70of235.bin", "group1-shard71of235.bin", "group1-shard72of235.bin", "group1-shard73of235.bin", "group1-shard74of235.bin", "group1-shard75of235.bin", "group1-shard76of235.bin", "group1-shard77of235.bin", "group1-shard78of235.bin", "group1-shard79of235.bin", "group1-shard80of235.bin", "group1-shard81of235.bin", "group1-shard82of235.bin", "group1-shard83of235.bin", "group1-shard84of235.bin", "group1-shard85of235.bin", "group1-shard86of235.bin", "group1-shard87of235.bin", "group1-shard88of235.bin", "group1-shard89of235.bin", "group1-shard90of235.bin", "group1-shard91of235.bin", "group1-shard92of235.bin", "group1-shard93of235.bin", "group1-shard94of235.bin", "group1-shard95of235.bin", "group1-shard96of235.bin", "group1-shard97of235.bin", "group1-shard98of235.bin", "group1-shard99of235.bin", "group1-shard100of235.bin", "group1-shard101of235.bin", "group1-shard102of235.bin", "group1-shard103of235.bin", "group1-shard104of235.bin", "group1-shard105of235.bin", "group1-shard106of235.bin", "group1-shard107of235.bin", "group1-shard108of235.bin", "group1-shard109of235.bin", "group1-shard110of235.bin", "group1-shard111of235.bin", "group1-shard112of235.bin", "group1-shard113of235.bin", "group1-shard114of235.bin", "group1-shard115of235.bin", "group1-shard116of235.bin", "group1-shard117of235.bin", "group1-shard118of235.bin", "group1-shard119of235.bin", "group1-shard120of235.bin", "group1-shard121of235.bin", "group1-shard122of235.bin", "group1-shard123of235.bin", "group1-shard124of235.bin", "group1-shard125of235.bin", "group1-shard126of235.bin", "group1-shard127of235.bin", "group1-shard128of235.bin", "group1-shard129of235.bin", "group1-shard130of235.bin", "group1-shard131of235.bin", "group1-shard132of235.bin", "group1-shard133of235.bin", "group1-shard134of235.bin", "group1-shard135of235.bin", "group1-shard136of235.bin", "group1-shard137of235.bin", "group1-shard138of235.bin", "group1-shard139of235.bin", "group1-shard140of235.bin", "group1-shard141of235.bin", "group1-shard142of235.bin", "group1-shard143of235.bin", "group1-shard144of235.bin", "group1-shard145of235.bin", "group1-shard146of235.bin", "group1-shard147of235.bin", "group1-shard148of235.bin", "group1-shard149of235.bin", "group1-shard150of235.bin", "group1-shard151of235.bin", "group1-shard152of235.bin", "group1-shard153of235.bin", "group1-shard154of235.bin", "group1-shard155of235.bin", "group1-shard156of235.bin", "group1-shard157of235.bin", "group1-shard158of235.bin", "group1-shard159of235.bin", "group1-shard160of235.bin", "group1-shard161of235.bin", "group1-shard162of235.bin", "group1-shard163of235.bin", "group1-shard164of235.bin", "group1-shard165of235.bin", "group1-shard166of235.bin", "group1-shard167of235.bin", "group1-shard168of235.bin", "group1-shard169of235.bin", "group1-shard170of235.bin", "group1-shard171of235.bin", "group1-shard172of235.bin", "group1-shard173of235.bin", "group1-shard174of235.bin", "group1-shard175of235.bin", "group1-shard176of235.bin", "group1-shard177of235.bin", "group1-shard178of235.bin", "group1-shard179of235.bin", "group1-shard180of235.bin", "group1-shard181of235.bin", "group1-shard182of235.bin", "group1-shard183of235.bin", "group1-shard184of235.bin", "group1-shard185of235.bin", "group1-shard186of235.bin", "group1-shard187of235.bin", "group1-shard188of235.bin", "group1-shard189of235.bin", "group1-shard190of235.bin", "group1-shard191of235.bin", "group1-shard192of235.bin", "group1-shard193of235.bin", "group1-shard194of235.bin", "group1-shard195of235.bin", "group1-shard196of235.bin", "group1-shard197of235.bin", "group1-shard198of235.bin", "group1-shard199of235.bin", "group1-shard200of235.bin", "group1-shard201of235.bin", "group1-shard202of235.bin", "group1-shard203of235.bin", "group1-shard204of235.bin", "group1-shard205of235.bin", "group1-shard206of235.bin", "group1-shard207of235.bin", "group1-shard208of235.bin", "group1-shard209of235.bin", "group1-shard210of235.bin", "group1-shard211of235.bin", "group1-shard212of235.bin", "group1-shard213of235.bin", "group1-shard214of235.bin", "group1-shard215of235.bin", "group1-shard216of235.bin", "group1-shard217of235.bin", "group1-shard218of235.bin", "group1-shard219of235.bin", "group1-shard220of235.bin", "group1-shard221of235.bin", "group1-shard222of235.bin", "group1-shard223of235.bin", "group1-shard224of235.bin", "group1-shard225of235.bin", "group1-shard226of235.bin", "group1-shard227of235.bin", "group1-shard228of235.bin", "group1-shard229of235.bin", "group1-shard230of235.bin", "group1-shard231of235.bin", "group1-shard232of235.bin", "group1-shard233of235.bin", "group1-shard234of235.bin", "group1-shard235of235.bin"], "weights": [{"name": "age/kernel", "shape": [128, 150], "dtype": "float32"}, {"name": "age/bias", "shape": [150], "dtype": "float32"}, {"name": "conv2d/kernel", "shape": [4, 4, 3, 200], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [200], "dtype": "float32"}, {"name": "dense/kernel", "shape": [1920800, 128], "dtype": "float32"}, {"name": "dense/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [128, 64], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [64, 32], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [32, 64], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_4/kernel", "shape": [64, 128], "dtype": "float32"}, {"name": "dense_4/bias", "shape": [128], "dtype": "float32"}, {"name": "ethnicity/kernel", "shape": [32, 3], "dtype": "float32"}, {"name": "ethnicity/bias", "shape": [3], "dtype": "float32"}, {"name": "gender/kernel", "shape": [32, 2], "dtype": "float32"}, {"name": "gender/bias", "shape": [2], "dtype": "float32"}]}]}